## :x: Plan Result

[CI link](https://github.com/kyma-project/test-infra/actions/runs/21058729748)



<pre><code>Error: &#34;account_id&#34; (&#34;azure-pipeline-image-builder-restricted-dev&#34;) doesn&#39;t match regexp &#34;^[a-z](?:[-a-z0-9]{4,28}[a-z0-9])$&#34;

  with google_service_account.kyma_project_image_builder_restricted_dev,
  on image-builder.tf line 76, in resource &#34;google_service_account&#34; &#34;kyma_project_image_builder_restricted_dev&#34;:
  76:   account_id  = var.image_builder_kyma-project_identity_restricted_dev.id


Error: &#34;account_id&#34; (&#34;azure-pipeline-image-builder-restricted-prod&#34;) doesn&#39;t match regexp &#34;^[a-z](?:[-a-z0-9]{4,28}[a-z0-9])$&#34;

  with google_service_account.kyma_project_image_builder_restricted_prod,
  on image-builder.tf line 83, in resource &#34;google_service_account&#34; &#34;kyma_project_image_builder_restricted_prod&#34;:
  83:   account_id  = var.image_builder_kyma-project_identity_restricted_prod.id


Note: Objects have changed outside of OpenTofu

OpenTofu detected the following changes made outside of OpenTofu since the
last &#34;tofu apply&#34; which may have affected this plan:

  # module.dev_docker_repository.google_artifact_registry_repository.protected_repository[0] has changed
  ~ resource &#34;google_artifact_registry_repository&#34; &#34;protected_repository&#34; {
        id                     = &#34;projects/kyma-project/locations/europe/repositories/dev&#34;
        name                   = &#34;dev&#34;
      ~ update_time            = &#34;2026-01-16T06:36:39.628713Z&#34; -&gt; &#34;2026-01-16T07:12:54.022246Z&#34;
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.docker_cache.google_artifact_registry_repository.unprotected_repository[0] has changed
  ~ resource &#34;google_artifact_registry_repository&#34; &#34;unprotected_repository&#34; {
        id                     = &#34;projects/kyma-project/locations/europe/repositories/cache&#34;
        name                   = &#34;cache&#34;
      ~ update_time            = &#34;2026-01-16T06:37:01.768199Z&#34; -&gt; &#34;2026-01-16T07:11:57.936195Z&#34;
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.dockerhub_mirror.google_artifact_registry_repository.unprotected_repository[0] has changed
  ~ resource &#34;google_artifact_registry_repository&#34; &#34;unprotected_repository&#34; {
        id                     = &#34;projects/kyma-project/locations/europe/repositories/dockerhub-mirror&#34;
        name                   = &#34;dockerhub-mirror&#34;
      ~ update_time            = &#34;2026-01-16T06:21:48.984502Z&#34; -&gt; &#34;2026-01-16T07:06:08.006190Z&#34;
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.prod_docker_repository.google_artifact_registry_repository.protected_repository[0] has changed
  ~ resource &#34;google_artifact_registry_repository&#34; &#34;protected_repository&#34; {
        id                     = &#34;projects/kyma-project/locations/europe/repositories/prod&#34;
        name                   = &#34;prod&#34;
      ~ update_time            = &#34;2026-01-16T06:28:25.016424Z&#34; -&gt; &#34;2026-01-16T07:09:42.297192Z&#34;
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  &#43; create

OpenTofu planned the following actions, but then encountered a problem:

  # google_cloud_identity_group_membership.markets_delivery_group_to_prod_read will be created
  &#43; resource &#34;google_cloud_identity_group_membership&#34; &#34;markets_delivery_group_to_prod_read&#34; {
      &#43; create_time = (known after apply)
      &#43; group       = &#34;groups/00xvir7l1dtv8ew&#34;
      &#43; id          = (known after apply)
      &#43; name        = (known after apply)
      &#43; type        = (known after apply)
      &#43; update_time = (known after apply)

      &#43; preferred_member_key {
          &#43; id = &#34;kyma-restricted-registry-markets-delivery@sap.com&#34;
        }

      &#43; roles {
          &#43; name = &#34;MEMBER&#34;
        }
    }

  # google_cloud_identity_group_membership.markets_delivery_sa_to_hierarchical_group will be created
  &#43; resource &#34;google_cloud_identity_group_membership&#34; &#34;markets_delivery_sa_to_hierarchical_group&#34; {
      &#43; create_time = (known after apply)
      &#43; group       = &#34;groups/03fwokq04jj0scm&#34;
      &#43; id          = (known after apply)
      &#43; name        = (known after apply)
      &#43; type        = (known after apply)
      &#43; update_time = (known after apply)

      &#43; preferred_member_key {
          &#43; id = &#34;restricted-markets-reg-reader@sap-kyma-prow.iam.gserviceaccount.com&#34;
        }

      &#43; roles {
          &#43; name = &#34;MEMBER&#34;
        }
    }

  # google_cloud_identity_group_membership.security_scanners_group_to_dev_read will be created
  &#43; resource &#34;google_cloud_identity_group_membership&#34; &#34;security_scanners_group_to_dev_read&#34; {
      &#43; create_time = (known after apply)
      &#43; group       = &#34;groups/0184mhaj2tdduaw&#34;
      &#43; id          = (known after apply)
      &#43; name        = (known after apply)
      &#43; type        = (known after apply)
      &#43; update_time = (known after apply)

      &#43; preferred_member_key {
          &#43; id = &#34;kyma-restricted-registry-security-scanners@sap.com&#34;
        }

      &#43; roles {
          &#43; name = &#34;MEMBER&#34;
        }
    }

  # google_cloud_identity_group_membership.security_scanners_group_to_prod_read will be created
  &#43; resource &#34;google_cloud_identity_group_membership&#34; &#34;security_scanners_group_to_prod_read&#34; {
      &#43; create_time = (known after apply)
      &#43; group       = &#34;groups/00xvir7l1dtv8ew&#34;
      &#43; id          = (known after apply)
      &#43; name        = (known after apply)
      &#43; type        = (known after apply)
      &#43; update_time = (known after apply)

      &#43; preferred_member_key {
          &#43; id = &#34;kyma-restricted-registry-security-scanners@sap.com&#34;
        }

      &#43; roles {
          &#43; name = &#34;MEMBER&#34;
        }
    }

  # google_cloud_identity_group_membership.security_scanners_sa_to_hierarchical_group will be created
  &#43; resource &#34;google_cloud_identity_group_membership&#34; &#34;security_scanners_sa_to_hierarchical_group&#34; {
      &#43; create_time = (known after apply)
      &#43; group       = &#34;groups/00meukdy10z0qky&#34;
      &#43; id          = (known after apply)
      &#43; name        = (known after apply)
      &#43; type        = (known after apply)
      &#43; update_time = (known after apply)

      &#43; preferred_member_key {
          &#43; id = &#34;kyma-security-scanners@sap-kyma-prow.iam.gserviceaccount.com&#34;
        }

      &#43; roles {
          &#43; name = &#34;MEMBER&#34;
        }
    }

  # google_secret_manager_secret.image_builder_sa_key_restricted_dev will be created
  &#43; resource &#34;google_secret_manager_secret&#34; &#34;image_builder_sa_key_restricted_dev&#34; {
      &#43; create_time           = (known after apply)
      &#43; effective_annotations = (known after apply)
      &#43; effective_labels      = {
          &#43; &#34;component&#34;                  = &#34;oci-image-builder&#34;
          &#43; &#34;environment&#34;                = &#34;restricted-dev&#34;
          &#43; &#34;goog-terraform-provisioned&#34; = &#34;true&#34;
          &#43; &#34;owner&#34;                      = &#34;neighbors&#34;
          &#43; &#34;tool&#34;                       = &#34;image-builder&#34;
          &#43; &#34;type&#34;                       = &#34;service-account-key&#34;
        }
      &#43; expire_time           = (known after apply)
      &#43; id                    = (known after apply)
      &#43; labels                = {
          &#43; &#34;component&#34;   = &#34;oci-image-builder&#34;
          &#43; &#34;environment&#34; = &#34;restricted-dev&#34;
          &#43; &#34;owner&#34;       = &#34;neighbors&#34;
          &#43; &#34;tool&#34;        = &#34;image-builder&#34;
          &#43; &#34;type&#34;        = &#34;service-account-key&#34;
        }
      &#43; name                  = (known after apply)
      &#43; project               = &#34;sap-kyma-prow&#34;
      &#43; secret_id             = &#34;image-builder-sa-key-restricted-dev&#34;
      &#43; terraform_labels      = {
          &#43; &#34;component&#34;                  = &#34;oci-image-builder&#34;
          &#43; &#34;environment&#34;                = &#34;restricted-dev&#34;
          &#43; &#34;goog-terraform-provisioned&#34; = &#34;true&#34;
          &#43; &#34;owner&#34;                      = &#34;neighbors&#34;
          &#43; &#34;tool&#34;                       = &#34;image-builder&#34;
          &#43; &#34;type&#34;                       = &#34;service-account-key&#34;
        }

      &#43; replication {
          &#43; auto {
            }
        }
    }

  # google_secret_manager_secret.image_builder_sa_key_restricted_prod will be created
  &#43; resource &#34;google_secret_manager_secret&#34; &#34;image_builder_sa_key_restricted_prod&#34; {
      &#43; create_time           = (known after apply)
      &#43; effective_annotations = (known after apply)
      &#43; effective_labels      = {
          &#43; &#34;component&#34;                  = &#34;oci-image-builder&#34;
          &#43; &#34;environment&#34;                = &#34;restricted-prod&#34;
          &#43; &#34;goog-terraform-provisioned&#34; = &#34;true&#34;
          &#43; &#34;owner&#34;                      = &#34;neighbors&#34;
          &#43; &#34;tool&#34;                       = &#34;image-builder&#34;
          &#43; &#34;type&#34;                       = &#34;service-account-key&#34;
        }
      &#43; expire_time           = (known after apply)
      &#43; id                    = (known after apply)
      &#43; labels                = {
          &#43; &#34;component&#34;   = &#34;oci-image-builder&#34;
          &#43; &#34;environment&#34; = &#34;restricted-prod&#34;
          &#43; &#34;owner&#34;       = &#34;neighbors&#34;
          &#43; &#34;tool&#34;        = &#34;image-builder&#34;
          &#43; &#34;type&#34;        = &#34;service-account-key&#34;
        }
      &#43; name                  = (known after apply)
      &#43; project               = &#34;sap-kyma-prow&#34;
      &#43; secret_id             = &#34;image-builder-sa-key-restricted-prod&#34;
      &#43; terraform_labels      = {
          &#43; &#34;component&#34;                  = &#34;oci-image-builder&#34;
          &#43; &#34;environment&#34;                = &#34;restricted-prod&#34;
          &#43; &#34;goog-terraform-provisioned&#34; = &#34;true&#34;
          &#43; &#34;owner&#34;                      = &#34;neighbors&#34;
          &#43; &#34;tool&#34;                       = &#34;image-builder&#34;
          &#43; &#34;type&#34;                       = &#34;service-account-key&#34;
        }

      &#43; replication {
          &#43; auto {
            }
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.
::error::OpenTofu exited with code 1.</code></pre>

* Create
  * google_cloud_identity_group_membership.markets_delivery_group_to_prod_read
  * google_cloud_identity_group_membership.markets_delivery_sa_to_hierarchical_group
  * google_cloud_identity_group_membership.security_scanners_group_to_dev_read
  * google_cloud_identity_group_membership.security_scanners_group_to_prod_read
  * google_cloud_identity_group_membership.security_scanners_sa_to_hierarchical_group
  * google_secret_manager_secret.image_builder_sa_key_restricted_dev
  * google_secret_manager_secret.image_builder_sa_key_restricted_prod





<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.dev_docker_repository.google_artifact_registry_repository.protected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/dev"
        name                   = "dev"
      ~ update_time            = "2026-01-16T06:36:39.628713Z" -> "2026-01-16T07:12:54.022246Z"
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.docker_cache.google_artifact_registry_repository.unprotected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "unprotected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/cache"
        name                   = "cache"
      ~ update_time            = "2026-01-16T06:37:01.768199Z" -> "2026-01-16T07:11:57.936195Z"
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.dockerhub_mirror.google_artifact_registry_repository.unprotected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "unprotected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/dockerhub-mirror"
        name                   = "dockerhub-mirror"
      ~ update_time            = "2026-01-16T06:21:48.984502Z" -> "2026-01-16T07:06:08.006190Z"
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.prod_docker_repository.google_artifact_registry_repository.protected_repository[0] has changed
  ~ resource "google_artifact_registry_repository" "protected_repository" {
        id                     = "projects/kyma-project/locations/europe/repositories/prod"
        name                   = "prod"
      ~ update_time            = "2026-01-16T06:28:25.016424Z" -> "2026-01-16T07:09:42.297192Z"
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>







<!-- github-comment: {"Command":"plan","JobName":"pull-plan-prod-terraform","PRNumber":13729,"Program":"tfcmt","SHA1":"af0e3644b7c309b6d56d2ff8b7fccd0bcb8521bb","Vars":{},"WorkflowName":"workflow-controller-pull-requests"} -->